app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:notice] = "successfully"
      redirect_to book_path(@book.id)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "wrjrh"], ["body", "vihv9lrmuuyeclyqsdy5"], ["created_at", "2020-11-21 03:18:19.135015"], ["updated_at", "2020-11-21 03:18:19.135015"]]
SELECT "books".* FROM "books"

  def edit
    flash[:notice] = "successfully"
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @book = Book.find(params[:id])
    @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "qkpmo"], ["body", "4ykaeer9dugv2no3gvpb"], ["updated_at", "2020-11-21 03:18:19.512327"], ["id", 1]]